benchmarks/wrk2_lua_scripts/hotel_user/original/100
Running 10s test @ http://pc70.cloudlab.umass.edu:8080/r/app/hotel
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.35ms    4.73ms  47.62ms   88.60%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.61ms
 75.000%   14.08ms
 90.000%   18.93ms
 99.000%   32.93ms
 99.900%   42.05ms
 99.990%   47.65ms
 99.999%   47.65ms
100.000%   47.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.007     0.000000            1         1.00
      10.087     0.100000          101         1.11
      10.455     0.200000          201         1.25
      10.735     0.300000          301         1.43
      11.111     0.400000          402         1.67
      11.607     0.500000          501         2.00
      11.967     0.550000          550         2.22
      12.295     0.600000          600         2.50
      12.895     0.650000          650         2.86
      13.503     0.700000          700         3.33
      14.079     0.750000          750         4.00
      14.487     0.775000          775         4.44
      15.095     0.800000          801         5.00
      15.543     0.825000          825         5.71
      16.263     0.850000          850         6.67
      17.487     0.875000          875         8.00
      18.271     0.887500          888         8.89
      18.927     0.900000          900        10.00
      19.679     0.912500          913        11.43
      20.559     0.925000          925        13.33
      21.503     0.937500          938        16.00
      22.687     0.943750          944        17.78
      23.327     0.950000          950        20.00
      24.207     0.956250          957        22.86
      25.103     0.962500          963        26.67
      25.951     0.968750          969        32.00
      26.527     0.971875          972        35.56
      26.735     0.975000          975        40.00
      28.175     0.978125          979        45.71
      28.591     0.981250          982        53.33
      29.503     0.984375          985        64.00
      29.807     0.985938          986        71.11
      32.335     0.987500          988        80.00
      32.927     0.989062          990        91.43
      33.599     0.990625          991       106.67
      37.215     0.992188          993       128.00
      37.215     0.992969          993       142.22
      37.503     0.993750          994       160.00
      38.463     0.994531          995       182.86
      38.559     0.995313          996       213.33
      38.879     0.996094          997       256.00
      38.879     0.996484          997       284.44
      38.879     0.996875          997       320.00
      41.727     0.997266          998       365.71
      41.727     0.997656          998       426.67
      42.047     0.998047          999       512.00
      42.047     0.998242          999       568.89
      42.047     0.998437          999       640.00
      42.047     0.998633          999       731.43
      42.047     0.998828          999       853.33
      47.647     0.999023         1000      1024.00
      47.647     1.000000         1000          inf
#[Mean    =       13.346, StdDeviation   =        4.731]
#[Max     =       47.616, Total count    =         1000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1002 requests in 10.01s, 185.92KB read
  Non-2xx or 3xx responses: 1002
Requests/sec:    100.07
Transfer/sec:     18.57KB