benchmarks/wrk2_lua_scripts/hotel_user/original/100
Running 10s test @ http://pc70.cloudlab.umass.edu:8080/r/app/hotel
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.20ms    3.14ms  34.34ms   89.70%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.24ms
 75.000%   12.59ms
 90.000%   15.45ms
 99.000%   26.00ms
 99.900%   34.14ms
 99.990%   34.37ms
 99.999%   34.37ms
100.000%   34.37ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.839     0.000000            1         1.00
       9.991     0.100000          100         1.11
      10.335     0.200000          200         1.25
      10.599     0.300000          300         1.43
      10.895     0.400000          400         1.67
      11.239     0.500000          503         2.00
      11.503     0.550000          553         2.22
      11.679     0.600000          601         2.50
      11.927     0.650000          650         2.86
      12.319     0.700000          701         3.33
      12.591     0.750000          750         4.00
      12.783     0.775000          776         4.44
      13.135     0.800000          803         5.00
      13.407     0.825000          826         5.71
      13.743     0.850000          850         6.67
      14.239     0.875000          875         8.00
      14.983     0.887500          888         8.89
      15.455     0.900000          900        10.00
      16.175     0.912500          913        11.43
      16.831     0.925000          925        13.33
      17.423     0.937500          938        16.00
      17.551     0.943750          944        17.78
      17.871     0.950000          950        20.00
      18.687     0.956250          957        22.86
      19.999     0.962500          963        26.67
      21.311     0.968750          969        32.00
      21.839     0.971875          972        35.56
      22.015     0.975000          975        40.00
      22.447     0.978125          979        45.71
      22.479     0.981250          982        53.33
      24.351     0.984375          985        64.00
      24.495     0.985938          986        71.11
      24.559     0.987500          988        80.00
      25.999     0.989062          990        91.43
      26.031     0.990625          991       106.67
      26.783     0.992188          993       128.00
      26.783     0.992969          993       142.22
      26.799     0.993750          994       160.00
      27.807     0.994531          995       182.86
      27.967     0.995313          996       213.33
      32.927     0.996094          998       256.00
      32.927     0.996484          998       284.44
      32.927     0.996875          998       320.00
      32.927     0.997266          998       365.71
      32.927     0.997656          998       426.67
      34.143     0.998047          999       512.00
      34.143     0.998242          999       568.89
      34.143     0.998437          999       640.00
      34.143     0.998633          999       731.43
      34.143     0.998828          999       853.33
      34.367     0.999023         1000      1024.00
      34.367     1.000000         1000          inf
#[Mean    =       12.201, StdDeviation   =        3.142]
#[Max     =       34.336, Total count    =         1000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1004 requests in 10.02s, 186.29KB read
  Non-2xx or 3xx responses: 1004
Requests/sec:    100.23
Transfer/sec:     18.60KB